In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [9]:
lst = [1,2,3] 
s = pd.Series(lst)
s = pd.Series(lst, index=['A', 'B', 'C'])
s

A    1
B    2
C    3
dtype: int64

## Q2: Change indexes to 11, 12, 13.

In [10]:
s.index = [11, 12, 13]
s

11    1
12    2
13    3
dtype: int64

## Q3: Retrieve First and second elements.

In [12]:
s.head(2)

11    1
12    2
dtype: int64

## Q4: Add duplicate elements, then remove the duplication

In [19]:
s2 = pd.Series({ 14 : 4 , 15: 1 })

s = s.append(s2)
s

C:\Users\khali\AppData\Local\Temp\ipykernel_13932\3467773451.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(s2)

11    1
12    2
13    3
14    4
15    1
14    4
15    1
dtype: int64

In [20]:
s.drop_duplicates()

11    1
12    2
13    3
14    4
dtype: int64

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [21]:
 data = {'ID': [11, 12, 13],
        'Name': ['Khalid', 'Faisal', 'Saud']}

un = pd.DataFrame(data, columns=['ID', 'Name'])
un

   ID    Name
0  11  Khalid
1  12  Faisal
2  13    Saud

## Q6: Read educ_figdp_1_Data.csv file

In [23]:
k = pd.read_csv('educ_figdp_1_Data.csv')
k

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [25]:
k.loc[0:6,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e

In [26]:
k.sample(3,random_state=11)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
153,2009,Estonia,Total public expenditure on education as % of ...,6.03,NaN
150,2006,Estonia,Total public expenditure on education as % of ...,4.70,NaN
334,2010,Portugal,Total public expenditure on education as % of ...,5.62,d